# Merging DataFrames with Pandas

As a data scientist, you'll often find that the data you need is not in a single file. It may be spread across a number of text files, spreadsheets, or databases. You’ll want to be able to import the data you’re interested in as a collection of DataFrames and combine them to answer your central questions. This notebook is all about the act of combining—or merging—DataFrames, an essential part of any data scientist's toolbox. You'll hone your pandas skills by learning how to organize, reshape, and aggregate multiple datasets to answer your specific questions.

## Reading DataFrames from multiple files

When data is spread among several files, you usually invoke pandas' `read_csv()` (or a similar data import function) multiple times to load the data into several DataFrames.

The data files for this example have been derived from a [list of Olympic medals awarded between 1896 & 2008 compiled by the Guardian](https://www.theguardian.com/sport/datablog/2012/jun/25/olympic-medal-winner-list-data).

The column labels of each DataFrame are NOC, Country, & Total where `NOC` is a three-letter code for the name of the country and Total is the number of medals of that type won (bronze, silver, or gold).

In [63]:
# Import pandas
import pandas as pd

dpath = 'data/dc10/summer-olympic-medals/'
dpath2 = 'data/dc10/'
dpath3 = 'data/dc10/baby-names/'
dpath4 = 'data/dc10/sales/'
dpath5 = 'data/dc10/gdp/'

In [23]:
# Read 'Bronze.csv' into a DataFrame: bronze
bronze = pd.read_csv(dpath+'Bronze.csv')
bronze.head()

   NOC         Country   Total
0  USA   United States  1052.0
1  URS    Soviet Union   584.0
2  GBR  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

In [24]:
# Read 'Silver.csv' into a DataFrame: silver
silver = pd.read_csv(dpath+'Silver.csv')
bronze.head()

   NOC         Country   Total
0  USA   United States  1052.0
1  URS    Soviet Union   584.0
2  GBR  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

In [25]:
# Read 'Gold.csv' into a DataFrame: gold
gold = pd.read_csv(dpath+'Gold.csv')
bronze.head()

   NOC         Country   Total
0  USA   United States  1052.0
1  URS    Soviet Union   584.0
2  GBR  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

## Reading DataFrames from multiple files in a loop

As you saw in the video, loading data from multiple files into DataFrames is more efficient in a **loop** or a **list comprehension**.

Notice that this approach is not restricted to working with CSV files. That is, even if your data comes in other formats, as long as pandas has a suitable data import function, you can apply a loop or comprehension to generate a list of DataFrames imported from the source files.

In [26]:
# Import pandas
import pandas as pd

# Create the list of file names: filenames
filenames = ['Gold.csv', 'Silver.csv', 'Bronze.csv']

# Create the list of three DataFrames: dataframes
dataframes = []
for filename in filenames:
    dataframes.append(pd.read_csv(dpath+filename))

# Print top 5 rows of 1st DataFrame in dataframes
print(dataframes[0].head())

   NOC         Country   Total
0  USA   United States  2088.0
1  URS    Soviet Union   838.0
2  GBR  United Kingdom   498.0
3  FRA          France   378.0
4  GER         Germany   407.0

## Combining DataFrames from multiple data files

In this exercise, you'll combine the three DataFrames from earlier exercises - gold, silver, & bronze - into a single DataFrame called medals. The approach you'll use here is clumsy. Later on in the course, you'll see various powerful methods that are frequently used in practice for concatenating or merging DataFrames.

Remember, the column labels of each DataFrame are NOC, Country, and Total, where NOC is a three-letter code for the name of the country and Total is the number of medals of that type won.

In [27]:
# Import pandas
import pandas as pd

# Make a copy of gold: medals
medals = gold.copy()

# Create list of new column labels: new_labels
new_labels = ['NOC', 'Country', 'Gold']

# Rename the columns of medals using new_labels
medals.columns = new_labels
medals.head()

   NOC         Country    Gold
0  USA   United States  2088.0
1  URS    Soviet Union   838.0
2  GBR  United Kingdom   498.0
3  FRA          France   378.0
4  GER         Germany   407.0

In [28]:
# Add columns 'Silver' & 'Bronze' to medals
medals['Silver'] = silver['Total']
medals['Bronze'] = bronze['Total']

In [29]:
# Print the head of medals
medals.head()

   NOC         Country    Gold  Silver  Bronze
0  USA   United States  2088.0  1195.0  1052.0
1  URS    Soviet Union   838.0   627.0   584.0
2  GBR  United Kingdom   498.0   591.0   505.0
3  FRA          France   378.0   461.0   475.0
4  GER         Germany   407.0   350.0   454.0

## Sorting DataFrame with the Index & columns

It is often useful to rearrange the sequence of the rows of a DataFrame by sorting. You don't have to implement these yourself; the principal methods for doing this are `.sort_index()` and `.sort_values()`.

In this exercise, you'll use these methods with a DataFrame of temperature values indexed by month names. You'll sort the rows alphabetically using the Index and numerically using a column. Notice, for this data, the original ordering is probably most useful and intuitive: the purpose here is for you to understand what the sorting methods do.

In [32]:
# Read 'monthly_max_temp.csv' into a DataFrame: weather1
# Read 'monthly_max_temp.csv' into a DataFrame called weather1 
#  with 'Month' as the index.
weather1 = pd.read_csv(dpath2+'monthly_max_temp.csv', index_col='Month')
weather1.head()

       Max TemperatureF
Month
Jan                  68
Feb                  60
Mar                  68
Apr                  84
May                  88

In [33]:
# Sort the index of weather1 in alphabetical order: weather2
weather2 = weather1.sort_index()
weather2.head()

       Max TemperatureF
Month
Apr                  84
Aug                  86
Dec                  68
Feb                  60
Jan                  68

In [34]:
# Sort the index of weather1 in reverse alphabetical order: weather3
weather3 = weather1.sort_index(ascending=False)
weather3.head()

       Max TemperatureF
Month
Sep                  90
Oct                  84
Nov                  72
May                  88
Mar                  68

In [35]:
# Sort weather1 numerically using the values of 'Max TemperatureF': weather4
weather4 = weather1.sort_values('Max TemperatureF')
weather4.head()

       Max TemperatureF
Month
Feb                  60
Jan                  68
Mar                  68
Dec                  68
Nov                  72

## Reindexing DataFrame from a list

Sorting methods are not the only way to change DataFrame Indexes. There is also the `.reindex()` method.

In this exercise, you'll reindex a DataFrame of quarterly-sampled mean temperature values to contain monthly samples (this is an example of upsampling or increasing the rate of samples).

The original data has the first month's abbreviation of the quarter (three-month interval) on the Index, namely Apr, Jan, Jul, and Oct. This data has been loaded into a DataFrame called `weather1`. Notice it has only four rows (corresponding to the first month of each quarter) and that the rows are not sorted chronologically.

You'll initially use a list of all twelve month abbreviations and subsequently apply the `.ffill()` method to forward-fill the null entries when upsampling. This list of month abbreviations has been pre-loaded as `year`.

In [36]:
year = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']

In [37]:
weather1 = pd.read_csv(dpath2+'weather1.csv', index_col='Month')
weather1.head()

       Mean TemperatureF
Month
Apr            61.956044
Jan            32.133333
Jul            68.934783
Oct            43.434783

In [38]:
# Reindex weather1 using the list year: weather2
# Reorder the rows of weather1 using the .reindex() method 
#  with the list year as the argument, which contains 
#  the abbreviations for each month.
weather2 = weather1.reindex(year)
weather2

       Mean TemperatureF
Month
Jan            32.133333
Feb                  NaN
Mar                  NaN
Apr            61.956044
May                  NaN
Jun                  NaN
Jul            68.934783
Aug                  NaN
Sep                  NaN
Oct            43.434783
Nov                  NaN
Dec                  NaN

In [39]:
# Reindex weather1 using the list year with forward-fill: weather3
# Reorder the rows of weather1 just as you did above, 
#  this time chaining the .ffill() method to replace the null values 
#  with the last preceding non-null value.

weather3 = weather1.reindex(year).ffill()
weather3

       Mean TemperatureF
Month
Jan            32.133333
Feb            32.133333
Mar            32.133333
Apr            61.956044
May            61.956044
Jun            61.956044
Jul            68.934783
Aug            68.934783
Sep            68.934783
Oct            43.434783
Nov            43.434783
Dec            43.434783

## Reindexing using another DataFrame Index

Another common technique is to reindex a DataFrame using the Index of another DataFrame. The DataFrame `.reindex()` method can accept the Index of a DataFrame or Series as input. You can access the Index of a DataFrame with its `.index` attribute.

The [Baby Names Dataset from data.gov](https://www.data.gov/developers/baby-names-dataset/) summarizes counts of names (with genders) from births registered in the US since 1881. In this exercise, you will start with two baby-names DataFrames `names_1981` and `names_1881` loaded for you.

The DataFrames `names_1981` and `names_1881` both have a MultiIndex with levels name and gender giving unique labels to counts in each row. If you're interested in seeing how the MultiIndexes were set up, `names_1981` and `names_1881` were read in using the following commands:

In [41]:
names_1981 = pd.read_csv(dpath3+'names1981.csv', header=None, names=['name','gender','count'], index_col=(0,1))
names_1881 = pd.read_csv(dpath3+'names1881.csv', header=None, names=['name','gender','count'], index_col=(0,1))

As you can see by looking at their shapes, the DataFrame corresponding to 1981 births is much larger, reflecting the greater diversity of names in 1981 as compared to 1881.

In [42]:
print(names_1881.shape)
print(names_1981.shape)

(1935, 1)
(19455, 1)

Your job here is to use the DataFrame `.reindex()` and `.dropna()` methods to make a DataFrame `common_names` counting names from 1881 that were still popular in 1981.

In [44]:
names_1881.head()

                  count
name      gender
Mary      F        6919
Anna      F        2698
Emma      F        2034
Elizabeth F        1852
Margaret  F        1658

In [43]:
names_1981.head()

                 count
name     gender
Jennifer F       57032
Jessica  F       42519
Amanda   F       34370
Sarah    F       28162
Melissa  F       28003

In [47]:
# Reindex names_1981 with index of names_1881: common_names
common_names = names_1981.reindex(names_1881.index)
common_names.shape

(1935, 1)

In [48]:
# Drop rows with null counts: common_names
common_names = common_names.dropna()
common_names.shape

(1587, 1)

## Adding unaligned DataFrames

The DataFrames `january` and `february`, represent the sales a company made in the corresponding months.

The Indexes in both DataFrames are called `Company`, identifying which company bought that quantity of units. The column `Units` is the number of units sold.

If you were to add these two DataFrames by executing the command `total = january + february`, how many rows would the resulting DataFrame have? Try this and find out for yourself.

In [50]:
jan = pd.read_csv(dpath4+'january.csv', index_col='Company')
jan

                  Units
Company
Acme Corporation     19
Hooli                17
Initech              20
Mediacore            10
Streeplex            13

In [51]:
feb = pd.read_csv(dpath4+'february.csv', index_col='Company')
feb

                  Units
Company
Acme Corporation     15
Hooli                 3
Mediacore            13
Vandelay Inc         25

In [52]:
total = jan + feb
total

                  Units
Company
Acme Corporation   34.0
Hooli              20.0
Initech             NaN
Mediacore          23.0
Streeplex           NaN
Vandelay Inc        NaN

january and february both consist of the sales of the Companies Acme Corporation, Hooli, and Mediacore. january has the additional two companies Initech and Streeplex, while february has the additional company Vandelay Inc. Together, they consist of the sales of 6 unique companies, and so total would have 6 rows.

## Broadcasting in arithmetic formulas

In this exercise, you'll work with weather data pulled from [wunderground.com](https://www.wunderground.com/). The DataFrame `weather` has been pre-loaded. It has 365 rows (observed each day of the year 2013 in Pittsburgh, PA) and 22 columns reflecting different weather measurements each day.

You'll subset a collection of columns related to temperature measurements in degrees Fahrenheit, convert them to degrees Celsius, and relabel the columns of the new DataFrame to reflect the change of units.

Remember, ordinary arithmetic operators (like +, -, *, and /) **broadcast** scalar values to conforming DataFrames when combining scalars & DataFrames in arithmetic expressions. **Broadcasting** also works with pandas Series and NumPy arrays.

In [57]:
weather = pd.read_csv(dpath2+'weather2.csv', index_col='Date', parse_dates=True)
weather.head()

,Max TemperatureF,Mean TemperatureF,Min TemperatureF,Max Dew PointF,MeanDew PointF,Min DewpointF,Max Humidity,Mean Humidity,Min Humidity,Max Sea Level PressureIn,...,Max VisibilityMiles,Mean VisibilityMiles,Min VisibilityMiles,Max Wind SpeedMPH,Mean Wind SpeedMPH,Max Gust SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
Date,,,,,,,,,,,,,,,,,,,,,
2013-01-01,32,28,21,30,27,16,100,89,77,30.10,...,10,6,2,10,8,NaN,0.00,8,Snow,277
2013-01-02,25,21,17,14,12,10,77,67,55,30.27,...,10,10,10,14,5,NaN,0.00,4,NaN,272
2013-01-03,32,24,16,19,15,9,77,67,56,30.25,...,10,10,10,17,8,26.0,0.00,3,NaN,229
2013-01-04,30,28,27,21,19,17,75,68,59,30.28,...,10,10,6,23,16,32.0,0.00,4,NaN,250
2013-01-05,34,30,25,23,20,16,75,68,61,30.42,...,10,10,10,16,10,23.0,0.21,5,NaN,221

In [60]:
# Extract selected columns from weather as new DataFrame: temps_f
# Create a new DataFrame temps_f by extracting the columns 'Min TemperatureF',
#  'Mean TemperatureF', & 'Max TemperatureF' from weather 
#  as a new DataFrame temps_f. To do this, pass the relevant 
#  columns as a list to weather[].
temps_f = weather[['Min TemperatureF', 'Mean TemperatureF', 'Max TemperatureF']]
temps_f.head()

            Min TemperatureF  Mean TemperatureF  Max TemperatureF
Date
2013-01-01                21                 28                32
2013-01-02                17                 21                25
2013-01-03                16                 24                32
2013-01-04                27                 28                30
2013-01-05                25                 30                34

In [61]:
# Convert temps_f to celsius: temps_c
temps_c = (temps_f - 32) * 5/9

In [62]:
# Rename 'F' in column names with 'C': temps_c.columns
# Rename the columns of temps_c to replace 'F' with 'C' 
#  using the .str.replace('F', 'C') method on temps_c.columns.
temps_c.columns = temps_c.columns.str.replace('F', 'C')
temps_c.head()

            Min TemperatureC  Mean TemperatureC  Max TemperatureC
Date
2013-01-01         -6.111111          -2.222222          0.000000
2013-01-02         -8.333333          -6.111111         -3.888889
2013-01-03         -8.888889          -4.444444          0.000000
2013-01-04         -2.777778          -2.222222         -1.111111
2013-01-05         -3.888889          -1.111111          1.111111

## Computing percentage growth of GDP

Your job in this exercise is to compute the yearly percent-change of US **GDP (Gross Domestic Product)** since 2008.

The data has been obtained from the [Federal Reserve Bank of St. Louis](https://fred.stlouisfed.org/series/GDP) and is available in the file `GDP.csv,` which contains quarterly data; you will **resample** it to annual sampling and then compute the annual growth of GDP.

In [66]:
# Read 'GDP.csv' into a DataFrame: gdp
# Read the file 'GDP.csv' into a DataFrame called gdp, 
#  using parse_dates=True and index_col='DATE'.
gdp = pd.read_csv(dpath5+'gdp_usa.csv', parse_dates=True, index_col='DATE')
gdp.head()

            VALUE
DATE
1947-01-01  243.1
1947-04-01  246.3
1947-07-01  250.1
1947-10-01  260.3
1948-01-01  266.2

In [70]:
# Slice all the gdp data from 2008 onward: post2008
post2008 = gdp.loc['2008':]
post2008

              VALUE
DATE
2008-01-01  14668.4
2008-04-01  14813.0
2008-07-01  14843.0
2008-10-01  14549.9
2009-01-01  14383.9
2009-04-01  14340.4
2009-07-01  14384.1
2009-10-01  14566.5
2010-01-01  14681.1
2010-04-01  14888.6
2010-07-01  15057.7
2010-10-01  15230.2
2011-01-01  15238.4
2011-04-01  15460.9
2011-07-01  15587.1
2011-10-01  15785.3
2012-01-01  15973.9
2012-04-01  16121.9
2012-07-01  16227.9
2012-10-01  16297.3
2013-01-01  16475.4
2013-04-01  16541.4
2013-07-01  16749.3
2013-10-01  16999.9
2014-01-01  17025.2
2014-04-01  17285.6
2014-07-01  17569.4
2014-10-01  17692.2
2015-01-01  17783.6
2015-04-01  17998.3
2015-07-01  18141.9
2015-10-01  18222.8
2016-01-01  18281.6
2016-04-01  18436.5

In [71]:
# Resample post2008 by year, keeping last(): yearly
# Create the DataFrame yearly by resampling the slice post2008 by year. 
#  Remember, you need to chain .resample() (using the alias 'A' 
#  for annual frequency) with some kind of aggregation; 
#  you will use the aggregation method .last() to select the last 
#  element when resampling.
yearly = post2008.resample('A').last()
yearly

              VALUE
DATE
2008-12-31  14549.9
2009-12-31  14566.5
2010-12-31  15230.2
2011-12-31  15785.3
2012-12-31  16297.3
2013-12-31  16999.9
2014-12-31  17692.2
2015-12-31  18222.8
2016-12-31  18436.5

In [72]:
# Compute percentage growth of yearly: yearly['growth']
yearly['growth'] = yearly.pct_change() * 100
yearly

              VALUE    growth
DATE
2008-12-31  14549.9       NaN
2009-12-31  14566.5  0.114090
2010-12-31  15230.2  4.556345
2011-12-31  15785.3  3.644732
2012-12-31  16297.3  3.243524
2013-12-31  16999.9  4.311144
2014-12-31  17692.2  4.072377
2015-12-31  18222.8  2.999062
2016-12-31  18436.5  1.172707

## Converting currency of stocks

In this exercise, stock prices in US Dollars for the S&P 500 in 2015 have been obtained from Yahoo Finance. The files sp500.csv for `sp500` and exchange.csv for the `exchange` rates are both provided to you.

Using the daily exchange rate to Pounds Sterling, your task is to convert both the Open and Close column prices.

In [73]:
# Read 'sp500.csv' into a DataFrame: sp500
sp500 = pd.read_csv(dpath2+'sp500.csv', parse_dates=True, index_col='Date')
sp500.head()

,Open,High,Low,Close,Volume,Adj Close
Date,,,,,,
2015-01-02,2058.899902,2072.360107,2046.040039,2058.199951,2708700000,2058.199951
2015-01-05,2054.439941,2054.439941,2017.339966,2020.579956,3799120000,2020.579956
2015-01-06,2022.150024,2030.250000,1992.439941,2002.609985,4460110000,2002.609985
2015-01-07,2005.550049,2029.609985,2005.550049,2025.900024,3805480000,2025.900024
2015-01-08,2030.609985,2064.080078,2030.609985,2062.139893,3934010000,2062.139893

In [74]:
# Read 'exchange.csv' into a DataFrame: exchange
exchange = pd.read_csv(dpath2+'exchange.csv', parse_dates=True, index_col='Date')
exchange.head()

            GBP/USD
Date
2015-01-02  0.65101
2015-01-05  0.65644
2015-01-06  0.65896
2015-01-07  0.66344
2015-01-08  0.66151

In [75]:
# Subset 'Open' & 'Close' columns from sp500: dollars
# Extract the columns 'Open' & 'Close' from the DataFrame sp500 
#  as a new DataFrame dollars and print the first 5 rows.
dollars = sp500[['Open', 'Close']]
dollars.head()

                   Open        Close
Date
2015-01-02  2058.899902  2058.199951
2015-01-05  2054.439941  2020.579956
2015-01-06  2022.150024  2002.609985
2015-01-07  2005.550049  2025.900024
2015-01-08  2030.609985  2062.139893

In [76]:
# Convert dollars to pounds: pounds
# Construct a new DataFrame pounds by converting US dollars to British pounds. 
#  You'll use the .multiply() method of dollars with exchange['GBP/USD'] 
#  and axis='rows'
pounds = dollars.multiply(exchange['GBP/USD'], axis='rows')
pounds.head()

                   Open        Close
Date
2015-01-02  1340.364425  1339.908750
2015-01-05  1348.616555  1326.389506
2015-01-06  1332.515980  1319.639876
2015-01-07  1330.562125  1344.063112
2015-01-08  1343.268811  1364.126161

## Appending Series with nonunique Indices

The Series bronze and silver represent the 5 countries that won the most bronze and silver Olympic medals respectively between 1896 & 2008. The Indexes of both Series are called Country and the values are the corresponding number of medals won.

If you were to run the command `combined = bronze.append(silver)`, how many rows would combined have? And how many rows would `combined.loc['United States']` return? Find out for yourself by running these commands.

bronze
Country
United States     1052.0
Soviet Union       584.0
United Kingdom     505.0
France             475.0
Germany            454.0
Name: Total, dtype: float64

silver
Country
United States     1195.0
Soviet Union       627.0
United Kingdom     591.0
France             461.0
Italy              394.0
Name: Total, dtype: float64

The `combined` Series has 10 rows and `combined.loc['United States']` has two rows, since the index value 'United States' occurs in both series bronze and silver.

## Appending pandas Series

In this exercise, you'll load sales data from the months January, February, and March into DataFrames. Then, you'll extract Series with the 'Units' column from each and append them together with method chaining using `.append()`.

To check that the stacking worked, you'll print slices from these Series, and finally, you'll add the result to figure out the total units sold in the first quarter.

In [80]:
# Load 'sales-jan-2015.csv' into a DataFrame: jan
jan = pd.read_csv(dpath4+'sales-jan-2015.csv', parse_dates=True, index_col='Date')
jan.head()

                       Company   Product  Units
Date
2015-01-21 19:13:21  Streeplex  Hardware     11
2015-01-09 05:23:51  Streeplex   Service      8
2015-01-06 17:19:34    Initech  Hardware     17
2015-01-02 09:51:06      Hooli  Hardware     16
2015-01-11 14:51:02      Hooli  Hardware     11

In [81]:
# Load 'sales-feb-2015.csv' into a DataFrame: feb
feb = pd.read_csv(dpath4+'sales-feb-2015.csv', parse_dates=True, index_col='Date')
feb.head()

                       Company   Product  Units
Date
2015-02-26 08:57:45  Streeplex   Service      4
2015-02-16 12:09:19      Hooli  Software     10
2015-02-03 14:14:18    Initech  Software     13
2015-02-02 08:33:01      Hooli  Software      3
2015-02-25 00:29:00    Initech   Service     10

In [82]:
# Load 'sales-mar-2015.csv' into a DataFrame: mar
mar = pd.read_csv(dpath4+'sales-mar-2015.csv', parse_dates=True, index_col='Date')
mar.head()

                       Company   Product  Units
Date
2015-03-22 14:42:25  Mediacore  Software      6
2015-03-12 18:33:06    Initech   Service     19
2015-03-22 03:58:28  Streeplex  Software      8
2015-03-15 00:53:12      Hooli  Hardware     19
2015-03-17 19:25:37      Hooli  Hardware     10

In [83]:
# Extract the 'Units' column from jan: jan_units
jan_units = jan['Units']

# Extract the 'Units' column from feb: feb_units
feb_units = feb['Units']

# Extract the 'Units' column from mar: mar_units
mar_units = mar['Units']

In [88]:
# Append feb_units and then mar_units to jan_units: quarter1
# Construct the Series quarter1 by appending feb_units to jan_units 
#  and then appending mar_units to the result. Use chained calls 
#  to the .append() method to do this.
quarter1 = jan_units.append(feb_units).append(mar_units)
quarter1[:10]

Date
2015-01-21 19:13:21    11
2015-01-09 05:23:51     8
2015-01-06 17:19:34    17
2015-01-02 09:51:06    16
2015-01-11 14:51:02    11
2015-01-01 07:31:20    18
2015-01-24 08:01:16     1
2015-01-25 15:40:07     6
2015-01-13 05:36:12     7
2015-01-03 18:00:19    19
Name: Units, dtype: int64

In [85]:
# Print the first slice from quarter1
# Print the slice containing rows from jan 27, 2015 to feb 2, 2015.
print(quarter1.loc['jan 27, 2015':'feb 2, 2015'])

Date
2015-01-27 07:11:55    18
2015-02-02 08:33:01     3
2015-02-02 20:54:49     9
Name: Units, dtype: int64

In [86]:
# Print the second slice from quarter1
# Print the slice containing rows from feb 26, 2015 to mar 7, 2015.
print(quarter1.loc['feb 26, 2015':'mar 7, 2015'])

Date
2015-02-26 08:57:45     4
2015-02-26 08:58:51     1
2015-03-06 10:11:45    17
2015-03-06 02:03:56    17
Name: Units, dtype: int64

In [89]:
# Compute & print total sales in quarter1
print(quarter1.sum())

642

## Concatenating pandas Series along row axis

Having learned how to append Series, you'll now learn how to achieve the same result by concatenating Series instead. You'll continue to work with the sales data you've seen previously.

Your job is to use `pd.concat()` with a list of Series to achieve the same result that you would get by chaining calls to `.append()`.

You may be wondering about the difference between `pd.concat()` and pandas' `.append()` method. One way to think of the difference is that `.append()` is a specific case of a concatenation, while `pd.concat()` gives you more flexibility, as you'll see in later exercises.

In [91]:
# Initialize empty list: units
units = []

# Build the list of Series
# In each iteration of the loop, append the 'Units' column of each DataFrame to units.
for month in [jan, feb, mar]:
    units.append(month['Units'])

In [92]:
units

[Date
 2015-01-21 19:13:21    11
 2015-01-09 05:23:51     8
 2015-01-06 17:19:34    17
 2015-01-02 09:51:06    16
 2015-01-11 14:51:02    11
 2015-01-01 07:31:20    18
 2015-01-24 08:01:16     1
 2015-01-25 15:40:07     6
 2015-01-13 05:36:12     7
 2015-01-03 18:00:19    19
 2015-01-16 00:33:47    17
 2015-01-16 07:21:12    13
 2015-01-20 19:49:24    12
 2015-01-26 01:50:25    14
 2015-01-15 02:38:25    16
 2015-01-06 13:47:37    16
 2015-01-15 15:33:40     7
 2015-01-27 07:11:55    18
 2015-01-20 11:28:02    13
 2015-01-16 19:20:46     8
 Name: Units, dtype: int64, Date
 2015-02-26 08:57:45     4
 2015-02-16 12:09:19    10
 2015-02-03 14:14:18    13
 2015-02-02 08:33:01     3
 2015-02-25 00:29:00    10
 2015-02-05 01:53:06    19
 2015-02-09 08:57:30    19
 2015-02-11 20:03:08     7
 2015-02-04 21:52:45    14
 2015-02-09 13:09:55     7
 2015-02-07 22:58:10     1
 2015-02-11 22:50:44     4
 2015-02-26 08:58:51     1
 2015-02-05 22:05:03    10
 2015-02-04 15:36:29    13
 2015-02-19 16:02:58    10
 2015-02-19 10:59:33    16
 2015-02-02 20:54:49     9
 2015-02-21 05:01:26     3
 2015-02-21 20:41:47     3
 Name: Units, dtype: int64, Date
 2015-03-22 14:42:25     6
 2015-03-12 18:33:06    19
 2015-03-22 03:58:28     8
 2015-03-15 00:53:12    19
 2015-03-17 19:25:37    10
 2015-03-16 05:54:06     3
 2015-03-25 10:18:10     9
 2015-03-25 16:42:42    12
 2015-03-26 05:20:04     3
 2015-03-06 10:11:45    17
 2015-03-22 21:14:39    11
 2015-03-17 19:38:12     8
 2015-03-28 19:20:38     5
 2015-03-13 04:41:32     8
 2015-03-06 02:03:56    17
 2015-03-13 11:40:16    11
 2015-03-27 08:29:45     6
 2015-03-21 06:42:41    19
 2015-03-15 08:50:45    18
 2015-03-13 16:25:24     9
 Name: Units, dtype: int64]

In [93]:
# Concatenate the list: quarter1
quarter1 = pd.concat(units, axis='rows')

In [94]:
# Print slices from quarter1
print(quarter1.loc['jan 27, 2015':'feb 2, 2015'])
print(quarter1.loc['feb 26, 2015':'mar 7, 2015'])

Date
2015-01-27 07:11:55    18
2015-02-02 08:33:01     3
2015-02-02 20:54:49     9
Name: Units, dtype: int64
Date
2015-02-26 08:57:45     4
2015-02-26 08:58:51     1
2015-03-06 10:11:45    17
2015-03-06 02:03:56    17
Name: Units, dtype: int64

## Appending DataFrames with ignore_index

In this exercise, you'll use the Baby Names Dataset (from data.gov) again. This time, both DataFrames `names_1981` and `names_1881` are loaded without specifying an Index column (so the default Indexes for both are RangeIndexes).

You'll use the DataFrame `.append()` method to make a DataFrame `combined_names`. To distinguish rows from the original two DataFrames, you'll add a `'year'` column to each with the year (1881 or 1981 in this case). In addition, you'll specify `ignore_index=True` so that the index values are not used along the concatenation axis. The resulting axis will instead be labeled 0, 1, ..., n-1, which is useful if you are concatenating objects where the concatenation axis does not have meaningful indexing information.

In [117]:
names_1981 = pd.read_csv(dpath3+'names1981.csv', header=None, names=['name','gender','count'], index_col=(0,1))
names_1881 = pd.read_csv(dpath3+'names1881.csv', header=None, names=['name','gender','count'], index_col=(0,1))

In [118]:
names_1881 = names_1881.reset_index()
names_1881.head()

        name gender  count
0       Mary      F   6919
1       Anna      F   2698
2       Emma      F   2034
3  Elizabeth      F   1852
4   Margaret      F   1658

In [119]:
names_1981 = names_1981.reset_index()
names_1981.head()

       name gender  count
0  Jennifer      F  57032
1   Jessica      F  42519
2    Amanda      F  34370
3     Sarah      F  28162
4   Melissa      F  28003

In [120]:
# Add 'year' column to names_1881 and names_1981
names_1881['year'] = 1881
names_1981['year'] = 1981

In [121]:
names_1881.head()

        name gender  count  year
0       Mary      F   6919  1881
1       Anna      F   2698  1881
2       Emma      F   2034  1881
3  Elizabeth      F   1852  1881
4   Margaret      F   1658  1881

In [122]:
# Append names_1981 after names_1881 with ignore_index=True: combined_names
combined_names = names_1881.append(names_1981, ignore_index=True)

In [123]:
# Print shapes of names_1981, names_1881, and combined_names
print(names_1981.shape)
print(names_1881.shape)
print(combined_names.shape)

(19455, 4)
(1935, 4)
(21390, 4)

In [124]:
combined_names.head()

        name gender  count  year
0       Mary      F   6919  1881
1       Anna      F   2698  1881
2       Emma      F   2034  1881
3  Elizabeth      F   1852  1881
4   Margaret      F   1658  1881

In [125]:
# Print all rows that contain the name 'Morgan'
print(combined_names.loc[combined_names['name'] == 'Morgan'])

         name gender  count  year
1283   Morgan      M     23  1881
2096   Morgan      F   1769  1981
14390  Morgan      M    766  1981

## Concatenating pandas DataFrames along column axis

The function `pd.concat()` can concatenate DataFrames horizontally as well as vertically (vertical is the default). To make the DataFrames stack horizontally, you have to specify the keyword argument `axis=1` or `axis='columns'`.

In this exercise, you'll use weather data with maximum and mean daily temperatures sampled at different rates (quarterly versus monthly). You'll concatenate the rows of both and see that, where rows are missing in the `coarser` DataFrame, null values are inserted in the `concatenated` DataFrame. This corresponds to an **outer join** (which you will explore in more detail in later exercises).

The files `'quarterly_max_temp.csv'` and `'monthly_mean_temp.csv'` have been pre-loaded into the DataFrames `weather_max` and `weather_mean` respectively, and pandas has been imported as pd.

In [126]:
weather_max = pd.read_csv(dpath2+'quarterly_max_temp.csv')
weather_max

  Month  Max TemperatureF
0   Jan                68
1   Apr                89
2   Jul                91
3   Oct                84

In [127]:
weather_mean = pd.read_csv(dpath2+'monthly_mean_temp.cs')
weather_mean

   Month  Mean TemperatureF
0    Apr          53.100000
1    Aug          70.000000
2    Dec          34.935484
3    Feb          28.714286
4    Jan          32.354839
5    Jul          72.870968
6    Jun          70.133333
7    Mar          35.000000
8    May          62.612903
9    Nov          39.800000
10   Oct          55.451613
11   Sep          63.766667

In [128]:
# Create a list of weather_max and weather_mean
weather_list = [weather_max, weather_mean]

In [129]:
# Concatenate weather_list horizontally
weather = pd.concat(weather_list, axis=1)
weather

   Month  Max TemperatureF Month  Mean TemperatureF
0    Jan              68.0   Apr          53.100000
1    Apr              89.0   Aug          70.000000
2    Jul              91.0   Dec          34.935484
3    Oct              84.0   Feb          28.714286
4    NaN               NaN   Jan          32.354839
5    NaN               NaN   Jul          72.870968
6    NaN               NaN   Jun          70.133333
7    NaN               NaN   Mar          35.000000
8    NaN               NaN   May          62.612903
9    NaN               NaN   Nov          39.800000
10   NaN               NaN   Oct          55.451613
11   NaN               NaN   Sep          63.766667

## Reading multiple files to build a DataFrame

It is often convenient to build a large DataFrame by parsing many files as DataFrames and concatenating them all at once. You'll do this here with three files, but, in principle, this approach can be used to combine data from dozens or hundreds of files.

Here, you'll work with DataFrames compiled from The Guardian's Olympic medal dataset.

In [130]:
medal_types = ['bronze', 'silver', 'gold']

In [138]:
#Initialize an empyy list: medals
medals =[]

In [139]:
for medal in medal_types:
    # Create the file name: file_name
    # The expression "%s_top5.csv" % medal evaluates as a string 
    #  with the value of medal replacing %s in the format string.
    file_name = "%s_top5.csv" % medal
    # Create list of column names: columns
    columns = ['Country', medal]
    # Read file_name into a DataFrame: medal_df
    medal_df = pd.read_csv(dpath+file_name, header=0, index_col='Country', names=columns)
    print(file_name)
    # Append medal_df to medals
    medals.append(medal_df)

medals

bronze_top5.csv
silver_top5.csv
gold_top5.csv

[                bronze
 Country
 United States   1052.0
 Soviet Union     584.0
 United Kingdom   505.0
 France           475.0
 Germany          454.0,                 silver
 Country
 United States   1195.0
 Soviet Union     627.0
 United Kingdom   591.0
 France           461.0
 Italy            394.0,                   gold
 Country
 United States   2088.0
 Soviet Union     838.0
 United Kingdom   498.0
 Italy            460.0
 Germany          407.0]

In [140]:
# Concatenate medals horizontally: medals_df
medals_df = pd.concat(medals, axis='columns')
medals_df

/Users/ksatola/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

                bronze  silver    gold
France           475.0   461.0     NaN
Germany          454.0     NaN   407.0
Italy              NaN   394.0   460.0
Soviet Union     584.0   627.0   838.0
United Kingdom   505.0   591.0   498.0
United States   1052.0  1195.0  2088.0

## Concatenating vertically to get MultiIndexed rows

When stacking a sequence of DataFrames vertically, it is sometimes desirable to construct a MultiIndex to indicate the DataFrame from which each row originated. This can be done by specifying the `keys` parameter in the call to `pd.concat()`, which generates a hierarchical index with the labels from keys as the outermost index label. So you don't have to rename the columns of each DataFrame as you load it. Instead, only the Index column needs to be specified.

In [148]:
medals = []
medal_types = ['bronze', 'silver', 'gold']

In [150]:
for medal in medal_types:

    file_name = "%s_top5.csv" % medal
    
    # Read file_name into a DataFrame: medal_df
    medal_df = pd.read_csv(dpath+file_name, index_col='Country')
    
    # Append medal_df to medals
    medals.append(medal_df)
    
# Concatenate medals: medals
medals = pd.concat(medals, keys=['bronze', 'silver', 'gold'])
medals

                        Total
       Country
bronze United States   1052.0
       Soviet Union     584.0
       United Kingdom   505.0
       France           475.0
       Germany          454.0
silver United States   1195.0
       Soviet Union     627.0
       United Kingdom   591.0
       France           461.0
       Italy            394.0
gold   United States   2088.0
       Soviet Union     838.0
       United Kingdom   498.0
       Italy            460.0
       Germany          407.0

## Slicing MultiIndexed DataFrames

This exercise picks up where the last ended (again using The Guardian's Olympic medal dataset).

You are provided with the MultiIndexed DataFrame as produced at the end of the preceding exercise. Your task is to sort the DataFrame and to use the `pd.IndexSlice` to extract specific slices.

In [151]:
# Sort the entries of medals: medals_sorted
medals_sorted = medals.sort_index(level=0)
medals_sorted

                        Total
       Country
bronze France           475.0
       Germany          454.0
       Soviet Union     584.0
       United Kingdom   505.0
       United States   1052.0
gold   Germany          407.0
       Italy            460.0
       Soviet Union     838.0
       United Kingdom   498.0
       United States   2088.0
silver France           461.0
       Italy            394.0
       Soviet Union     627.0
       United Kingdom   591.0
       United States   1195.0

In [153]:
# Print the number of Bronze medals won by Germany
medals_sorted.loc[('bronze','Germany')]

Total    454.0
Name: (bronze, Germany), dtype: float64

In [154]:
# Print data about silver medals
print(medals_sorted.loc['silver'])

                 Total
Country
France           461.0
Italy            394.0
Soviet Union     627.0
United Kingdom   591.0
United States   1195.0

In [155]:
# Create alias for pd.IndexSlice: idx
idx = pd.IndexSlice

# Print all the data on medals won by the United Kingdom
print(medals_sorted.loc[idx[:,'United Kingdom'], :])

                       Total
       Country
bronze United Kingdom  505.0
gold   United Kingdom  498.0
silver United Kingdom  591.0

## Concatenating horizontally to get MultiIndexed columns

It is also possible to construct a DataFrame with hierarchically indexed columns. For this exercise, you'll start with pandas imported and a list of three DataFrames called `dataframes`. All three DataFrames contain `'Company'`, `'Product'`, and `'Units'` columns with a `'Date'` column as the index pertaining to sales transactions during the month of February, 2015. The first DataFrame describes Hardware transactions, the second describes Software transactions, and the third, Service transactions.

Your task is to concatenate the DataFrames horizontally and to create a MultiIndex on the columns. From there, you can summarize the resulting DataFrame and slice some information from it.

In [156]:
dataframes = []
file_names = ['feb-sales-Hardware.csv', 'feb-sales-Software.csv', 'feb-sales-Service.csv']

for file_name in file_names:

    # Read file_name into a DataFrame: medal_df
    df = pd.read_csv(dpath4+file_name, index_col='Date', parse_dates=True)
    
    # Append medal_df to medals
    dataframes.append(df)

In [157]:
dataframes

[                             Company   Product  Units
 Date
 2015-02-04 21:52:45  Acme Coporation  Hardware     14
 2015-02-07 22:58:10  Acme Coporation  Hardware      1
 2015-02-19 10:59:33        Mediacore  Hardware     16
 2015-02-02 20:54:49        Mediacore  Hardware      9
 2015-02-21 20:41:47            Hooli  Hardware      3,
                              Company   Product  Units
 Date
 2015-02-16 12:09:19            Hooli  Software     10
 2015-02-03 14:14:18          Initech  Software     13
 2015-02-02 08:33:01            Hooli  Software      3
 2015-02-05 01:53:06  Acme Coporation  Software     19
 2015-02-11 20:03:08          Initech  Software      7
 2015-02-09 13:09:55        Mediacore  Software      7
 2015-02-11 22:50:44            Hooli  Software      4
 2015-02-04 15:36:29        Streeplex  Software     13
 2015-02-21 05:01:26        Mediacore  Software      3,
                        Company  Product  Units
 Date
 2015-02-26 08:57:45  Streeplex  Service      4
 2015-02-25 00:29:00    Initech  Service     10
 2015-02-09 08:57:30  Streeplex  Service     19
 2015-02-26 08:58:51  Streeplex  Service      1
 2015-02-05 22:05:03      Hooli  Service     10
 2015-02-19 16:02:58  Mediacore  Service     10]

In [158]:
# Concatenate dataframes: february
# Construct a new DataFrame february with MultiIndexed columns 
#  by concatenating the list dataframes.
# Use axis=1 to stack the DataFrames horizontally and 
#  the keyword argument keys=['Hardware', 'Software', 'Service'] 
#  to construct a hierarchical Index from each DataFrame.
february = pd.concat(dataframes, keys=['Hardware', 'Software', 'Service'], axis=1)
february

                            Hardware                         Software  \
                             Company   Product Units          Company
Date
2015-02-02 08:33:01              NaN       NaN   NaN            Hooli
2015-02-02 20:54:49        Mediacore  Hardware   9.0              NaN
2015-02-03 14:14:18              NaN       NaN   NaN          Initech
2015-02-04 15:36:29              NaN       NaN   NaN        Streeplex
2015-02-04 21:52:45  Acme Coporation  Hardware  14.0              NaN
2015-02-05 01:53:06              NaN       NaN   NaN  Acme Coporation
2015-02-05 22:05:03              NaN       NaN   NaN              NaN
2015-02-07 22:58:10  Acme Coporation  Hardware   1.0              NaN
2015-02-09 08:57:30              NaN       NaN   NaN              NaN
2015-02-09 13:09:55              NaN       NaN   NaN        Mediacore
2015-02-11 20:03:08              NaN       NaN   NaN          Initech
2015-02-11 22:50:44              NaN       NaN   NaN            Hooli
2015-02-16 12:09:19              NaN       NaN   NaN            Hooli
2015-02-19 10:59:33        Mediacore  Hardware  16.0              NaN
2015-02-19 16:02:58              NaN       NaN   NaN              NaN
2015-02-21 05:01:26              NaN       NaN   NaN        Mediacore
2015-02-21 20:41:47            Hooli  Hardware   3.0              NaN
2015-02-25 00:29:00              NaN       NaN   NaN              NaN
2015-02-26 08:57:45              NaN       NaN   NaN              NaN
2015-02-26 08:58:51              NaN       NaN   NaN              NaN

                                       Service
                      Product Units    Company  Product Units
Date
2015-02-02 08:33:01  Software   3.0        NaN      NaN   NaN
2015-02-02 20:54:49       NaN   NaN        NaN      NaN   NaN
2015-02-03 14:14:18  Software  13.0        NaN      NaN   NaN
2015-02-04 15:36:29  Software  13.0        NaN      NaN   NaN
2015-02-04 21:52:45       NaN   NaN        NaN      NaN   NaN
2015-02-05 01:53:06  Software  19.0        NaN      NaN   NaN
2015-02-05 22:05:03       NaN   NaN      Hooli  Service  10.0
2015-02-07 22:58:10       NaN   NaN        NaN      NaN   NaN
2015-02-09 08:57:30       NaN   NaN  Streeplex  Service  19.0
2015-02-09 13:09:55  Software   7.0        NaN      NaN   NaN
2015-02-11 20:03:08  Software   7.0        NaN      NaN   NaN
2015-02-11 22:50:44  Software   4.0        NaN      NaN   NaN
2015-02-16 12:09:19  Software  10.0        NaN      NaN   NaN
2015-02-19 10:59:33       NaN   NaN        NaN      NaN   NaN
2015-02-19 16:02:58       NaN   NaN  Mediacore  Service  10.0
2015-02-21 05:01:26  Software   3.0        NaN      NaN   NaN
2015-02-21 20:41:47       NaN   NaN        NaN      NaN   NaN
2015-02-25 00:29:00       NaN   NaN    Initech  Service  10.0
2015-02-26 08:57:45       NaN   NaN  Streeplex  Service   4.0
2015-02-26 08:58:51       NaN   NaN  Streeplex  Service   1.0

In [159]:
# Assign pd.IndexSlice: idx
idx = pd.IndexSlice

In [160]:
# Create the slice: slice_2_8
# Extract a slice called slice_2_8 from february (using .loc[] & idx) 
#  that comprises rows between Feb. 2, 2015 to Feb. 8, 2015 
#  from columns under 'Company'.
slice_2_8 = february.loc['2015-2-2':'2015-2-8', idx[:, 'Company']]
slice_2_8

                            Hardware         Software Service
                             Company          Company Company
Date
2015-02-02 08:33:01              NaN            Hooli     NaN
2015-02-02 20:54:49        Mediacore              NaN     NaN
2015-02-03 14:14:18              NaN          Initech     NaN
2015-02-04 15:36:29              NaN        Streeplex     NaN
2015-02-04 21:52:45  Acme Coporation              NaN     NaN
2015-02-05 01:53:06              NaN  Acme Coporation     NaN
2015-02-05 22:05:03              NaN              NaN   Hooli
2015-02-07 22:58:10  Acme Coporation              NaN     NaN

## Concatenating DataFrames from a dict

You're now going to revisit the sales data you worked with earlier. Three DataFrames `jan`, `feb`, and `mar` have been pre-loaded for you. Your task is to aggregate the sum of all sales over the 'Company' column into a single DataFrame. You'll do this by constructing a dictionary of these DataFrames and then concatenating them.

In [161]:
# Make the list of tuples: month_list
month_list = [('january', jan), ('february', feb), ('march', mar)]

In [162]:
# Create an empty dictionary: month_dict
month_dict = {}

for month_name, month_data in month_list:

    # Group month_data: month_dict[month_name]
    month_dict[month_name] = month_data.groupby('Company').sum()

In [163]:
# Concatenate data in month_dict: sales
sales = pd.concat(month_dict)
sales

                          Units
         Company
february Acme Coporation     34
         Hooli               30
         Initech             30
         Mediacore           45
         Streeplex           37
january  Acme Coporation     76
         Hooli               70
         Initech             37
         Mediacore           15
         Streeplex           50
march    Acme Coporation      5
         Hooli               37
         Initech             68
         Mediacore           68
         Streeplex           40

In [164]:
# Print all sales by Mediacore
idx = pd.IndexSlice
print(sales.loc[idx[:, 'Mediacore'], :])

                    Units
         Company
february Mediacore     45
january  Mediacore     15
march    Mediacore     68

## Concatenating DataFrames with inner join

Here, you'll continue working with DataFrames compiled from The Guardian's Olympic medal dataset. The DataFrames bronze, silver, and gold have been pre-loaded for you. Your task is to compute an **inner join**.

In [167]:
gold = pd.read_csv(dpath+'gold_top5.csv', index_col='Country')
gold

                 Total
Country
United States   2088.0
Soviet Union     838.0
United Kingdom   498.0
Italy            460.0
Germany          407.0

In [168]:
silver = pd.read_csv(dpath+'silver_top5.csv', index_col='Country')
silver

                 Total
Country
United States   1195.0
Soviet Union     627.0
United Kingdom   591.0
France           461.0
Italy            394.0

In [169]:
bronze = pd.read_csv(dpath+'bronze_top5.csv', index_col='Country')
bronze

                 Total
Country
United States   1052.0
Soviet Union     584.0
United Kingdom   505.0
France           475.0
Germany          454.0

In [170]:
# Create the list of DataFrames: medal_list
medal_list = [bronze, silver, gold]

In [171]:
# Concatenate medal_list horizontally using an inner join: medals
medals = pd.concat(medal_list, keys=['bronze', 'silver', 'gold'], axis=1, join='inner')
medals

                bronze  silver    gold
                 Total   Total   Total
Country
United States   1052.0  1195.0  2088.0
Soviet Union     584.0   627.0   838.0
United Kingdom   505.0   591.0   498.0

## Resampling & concatenating DataFrames with inner join

In this exercise, you'll compare the historical 10-year GDP (Gross Domestic Product) growth in the US and in China. The data for the US starts in 1947 and is recorded quarterly; by contrast, the data for China starts in 1961 and is recorded annually.

You'll need to use a combination of **resampling** and an **inner join** to align the index labels. You'll need an appropriate offset alias for resampling, and the method `.resample()` must be chained with some kind of aggregation method (`.pct_change()` and `.last()` in this case).

In [172]:
us = pd.read_csv(dpath5+'gdp_usa.csv', parse_dates=True, index_col='DATE')
us.head()

            VALUE
DATE
1947-01-01  243.1
1947-04-01  246.3
1947-07-01  250.1
1947-10-01  260.3
1948-01-01  266.2

In [175]:
china = pd.read_csv(dpath5+'gdp_china.csv', parse_dates=True, index_col='Year')
china.head()

                  GDP
Year
1960-01-01  59.184116
1961-01-01  49.557050
1962-01-01  46.685179
1963-01-01  50.097303
1964-01-01  59.062255

In [177]:
# Resample and tidy china: china_annual
# Make a new DataFrame china_annual by resampling the DataFrame china 
#  with .resample('A').last() (i.e., with annual frequency) 
#  and chaining two method calls:
#  - Chain .pct_change(10) as an aggregation method to compute the percentage 
#    change with an offset of ten years.
#  - Chain .dropna() to eliminate rows containing null values.
china_annual = china.resample('A').last().pct_change(10).dropna()
china_annual.head()

                 GDP
Year
1970-12-31  0.546128
1971-12-31  0.988860
1972-12-31  1.402472
1973-12-31  1.730085
1974-12-31  1.408556

In [182]:
# Resample and tidy us in the same way as china: us_annual
us_annual = us.resample('A').last().pct_change(10).dropna()
us_annual.head()

               VALUE
DATE
1957-12-31  0.827507
1958-12-31  0.782686
1959-12-31  0.953137
1960-12-31  0.689354
1961-12-31  0.630959

In [179]:
# Concatenate china_annual and us_annual: gdp
# Concatenate china_annual and us_annual to construct a DataFrame called gdp. 
#  Use join='inner' to perform an inner join and use axis=1 
#  to concatenate horizontally.
gdp = pd.concat([china_annual, us_annual], axis=1, join='inner')

# Resample gdp and print
print(gdp.resample('10A').last())

                 GDP     VALUE
Year
1970-12-31  0.546128  1.017187
1980-12-31  1.072537  1.742556
1990-12-31  0.892820  1.012126
2000-12-31  2.357522  0.738632
2010-12-31  4.011081  0.454332
2020-12-31  3.789936  0.361780

## Merging company DataFrames

Suppose your company has operations in several different cities under several different managers. The DataFrames revenue and managers contain partial information related to the company. That is, the rows of the city columns don't quite match in revenue and managers (the Mendocino branch has no revenue yet since it just opened and the manager of Springfield branch recently left the company).

The DataFrames have been printed below. If you were to run the command `combined = pd.merge(revenue, managers, on='city')`, how many rows would combined have?

          city  revenue
0       Austin      100
1       Denver       83
2  Springfield        4

        city   manager
0     Austin  Charlers
1     Denver      Joel
2  Mendocino     Brett

In [1]: combined = pd.merge(revenue, managers, on='city')

In [2]: combined.shape
Out[2]: (2, 3)

Since the default strategy for `pd.merge()` is an **inner join**, combined will have 2 rows.

## Merging on a specific column

This exercise follows on the last one with the DataFrames `revenue` and `managers` for your company. You expect your company to grow and, eventually, to operate in cities with the same name on different states. As such, you decide that every branch should have a numerical branch identifier. Thus, you add a `branch_id` column to both DataFrames. Moreover, new cities have been added to both the revenue and managers DataFrames as well.

At present, there should be a 1-to-1 relationship between the `city` and `branch_id` fields. In that case, the result of a merge on the city columns ought to give you the same output as a merge on the branch_id columns. Do they? Can you spot an ambiguity in one of the DataFrames?

In [184]:
revenue = pd.read_csv(dpath2+'revenue.csv')
del revenue['Unnamed: 0']
revenue.head()

          city  branch_id  revenue
0       Austin         10      100
1       Denver         20       83
2  Springfield         30        4
3    Mendocino         47      200

In [185]:
managers = pd.read_csv(dpath2+'managers.csv')
del managers['Unnamed: 0']
managers.head()

          city  branch_id  manager
0       Austin         10  Charles
1       Denver         20     Joel
2    Mendocino         47    Brett
3  Springfield         31    Sally

In [186]:
# Merge revenue with managers on 'city': merge_by_city
# Using pd.merge(), merge the DataFrames revenue and managers 
#  on the 'city' column of each. Store the result as merge_by_city.
merge_by_city = pd.merge(revenue, managers, on='city')
merge_by_city

          city  branch_id_x  revenue  branch_id_y  manager
0       Austin           10      100           10  Charles
1       Denver           20       83           20     Joel
2  Springfield           30        4           31    Sally
3    Mendocino           47      200           47    Brett

In [187]:
# Merge revenue with managers on 'branch_id': merge_by_id
merge_by_id = pd.merge(revenue, managers, on='branch_id')
merge_by_id

      city_x  branch_id  revenue     city_y  manager
0     Austin         10      100     Austin  Charles
1     Denver         20       83     Denver     Joel
2  Mendocino         47      200  Mendocino    Brett

Notice that when you merge on `'city'`, the resulting DataFrame has a peculiar result: In row 2, the city Springfield has two different branch IDs. This is because there are actually two different cities named Springfield - one in the State of Illinois, and the other in Missouri. The revenue DataFrame has the one from Illinois, and the managers DataFrame has the one from Missouri. Consequently, when you merge on `'branch_id'`, both of these get dropped from the merged DataFrame.

## Merging on columns with non-matching labels

You continue working with the `revenue` & `managers` DataFrames from before. This time, someone has changed the field name `'city'` to `'branch'` in the managers table. Now, when you attempt to merge DataFrames, an exception is thrown:

>>> pd.merge(revenue, managers, on='city')
Traceback (most recent call last):
    ... <text deleted> ...
    pd.merge(revenue, managers, on='city')
    ... <text deleted> ...
KeyError: 'city'

Given this, it will take a bit more work for you to join or merge on the city/branch name. You have to specify the `left_on` and `right_on` parameters in the call to `pd.merge()`.

Are you able to merge better than in the last exercise? How should the rows with Springfield be handled?

In [189]:
managers.columns = ['branch',  'branch_id',  'manager']

In [190]:
managers

        branch  branch_id  manager
0       Austin         10  Charles
1       Denver         20     Joel
2    Mendocino         47    Brett
3  Springfield         31    Sally

In [191]:
# Merge revenue & managers on 'city' & 'branch': combined
combined = pd.merge(revenue, managers, left_on='city', right_on='branch')
combined

          city  branch_id_x  revenue       branch  branch_id_y  manager
0       Austin           10      100       Austin           10  Charles
1       Denver           20       83       Denver           20     Joel
2  Springfield           30        4  Springfield           31    Sally
3    Mendocino           47      200    Mendocino           47    Brett

## Merging on multiple columns

Another strategy to disambiguate cities with identical names is to add information on the states in which the cities are located. To this end, you add a column called `state` to both DataFrames from the preceding exercises.

Your goal in this exercise is to use `pd.merge()` to merge DataFrames using multiple columns (using `'branch_id'`, `'city'`, and `'state'` in this case).

Are you able to match all your company's branches correctly?

In [200]:
revenue

          city  branch_id  revenue state
0       Austin         10      100    TX
1       Denver         20       83    CO
2  Springfield         30        4    IL
3    Mendocino         47      200    CA

In [201]:
managers.columns = ['city', 'branch_id', 'manager', 'state']
managers

          city  branch_id  manager state
0       Austin         10  Charles    TX
1       Denver         20     Joel    CO
2    Mendocino         47    Brett    CA
3  Springfield         31    Sally    MO

In [202]:
# Add 'state' column to revenue: revenue['state']
# Create a column called 'state' in the DataFrame revenue, 
#  consisting of the list ['TX','CO','IL','CA'].
revenue['state'] = ['TX','CO','IL','CA']

In [203]:
# Add 'state' column to managers: managers['state']
# Create a column called 'state' in the DataFrame managers, 
#  consisting of the list ['TX','CO','CA','MO'].
managers['state'] = ['TX','CO','CA','MO']

In [204]:
# Merge revenue & managers on 'branch_id', 'city', & 'state': combined
combined = pd.merge(revenue, managers, on=['branch_id', 'city', 'state'])
combined

        city  branch_id  revenue state  manager
0     Austin         10      100    TX  Charles
1     Denver         20       83    CO     Joel
2  Mendocino         47      200    CA    Brett

## Joining by Index

The DataFrames `revenue` and `managers` are displayed in the IPython Shell. Here, they are indexed by `'branch_id'`.

Choose the function call below that will join the DataFrames on their indexes and return 5 rows with index labels `[10, 20, 30, 31, 47]`. (answer: In [3])

                  city state  revenue
branch_id                            
10              Austin    TX      100
20              Denver    CO       83
30         Springfield    IL        4
47           Mendocino    CA      200

                branch state   manager
branch_id                             
10              Austin    TX  Charlers
20              Denver    CO      Joel
47           Mendocino    CA     Brett
31         Springfield    MO     Sally

In [1]: pd.merge(revenue, managers, on='branch_id')
Out[1]: 
                city state_x  revenue     branch state_y   manager
branch_id                                                         
10            Austin      TX      100     Austin      TX  Charlers
20            Denver      CO       83     Denver      CO      Joel
47         Mendocino      CA      200  Mendocino      CA     Brett

In [2]: pd.merge(managers, revenue, how='left')
Out[2]: 
        branch state   manager       city  revenue
0       Austin    TX  Charlers     Austin    100.0
1       Denver    CO      Joel     Denver     83.0
2    Mendocino    CA     Brett  Mendocino    200.0
3  Springfield    MO     Sally        NaN      NaN

In [3]: revenue.join(managers, lsuffix='_rev', rsuffix='_mng', how='outer')
Out[3]: 
                  city state_rev  revenue       branch state_mng   manager
branch_id                                                                 
10              Austin        TX    100.0       Austin        TX  Charlers
20              Denver        CO     83.0       Denver        CO      Joel
30         Springfield        IL      4.0          NaN       NaN       NaN
31                 NaN       NaN      NaN  Springfield        MO     Sally
47           Mendocino        CA    200.0    Mendocino        CA     Brett

In [4]: managers.join(revenue, lsuffix='_mgn', rsuffix='_rev', how='left')
Out[4]: 
                branch state_mgn   manager       city state_rev  revenue
branch_id                                                               
10              Austin        TX  Charlers     Austin        TX    100.0
20              Denver        CO      Joel     Denver        CO     83.0
47           Mendocino        CA     Brett  Mendocino        CA    200.0
31         Springfield        MO     Sally        NaN       NaN      NaN

In [5]:

## Choosing a joining strategy

Suppose you have two DataFrames: `students` (with columns 'StudentID', 'LastName', 'FirstName', and 'Major') and `midterm_results` (with columns 'StudentID', 'Q1', 'Q2', and 'Q3' for their scores on midterm questions).

You want to combine the DataFrames into a single DataFrame `grades`, and be able to easily spot which students wrote the midterm and which didn't (their midterm question scores 'Q1', 'Q2', & 'Q3' should be filled with NaN values).

You also want to drop rows from `midterm_results` in which the StudentID is not found in students.

Which of the following strategies gives the desired result?

grades = pd.merge(students, midterm_results, how='left')

## Left & right merging on multiple columns

You now have, in addition to the `revenue` and `managers` DataFrames from prior exercises, a DataFrame `sales` that summarizes units sold from specific branches (identified by city and state but not branch_id).

Once again, the `managers` DataFrame uses the label branch in place of city as in the other two DataFrames. Your task here is to employ left and right merges to preserve data and identify where data is missing.

By merging `revenue` and `sales` with a right merge, you can identify the missing `revenue` values. Here, you don't need to specify `left_on` or `right_on` because the columns to merge on have matching labels.

By merging `sales` and `managers` with a left merge, you can identify the missing `manager`. Here, the columns to merge on have conflicting labels, so you must specify `left_on` and `right_on`. In both cases, you're looking to figure out how to connect the fields in rows containing Springfield.

In [208]:
managers = pd.read_csv(dpath2+'managers2.csv')
del managers['Unnamed: 0']
managers

        branch  branch_id state   manager
0       Austin         10    TX  Charlers
1       Denver         20    CO      Joel
2    Mendocino         47    CA     Brett
3  Springfield         31    MO     Sally

In [209]:
revenue = pd.read_csv(dpath2+'revenue2.csv')
del revenue['Unnamed: 0']
revenue

          city  branch_id state  revenue
0       Austin         10    TX      100
1       Denver         20    CO       83
2  Springfield         30    IL        4
3    Mendocino         47    CA      200

In [210]:
sales = pd.read_csv(dpath2+'sales2.csv')
del sales['Unnamed: 0']
sales

          city state  units
0    Mendocino    CA      1
1       Denver    CO      4
2       Austin    TX      2
3  Springfield    MO      5
4  Springfield    IL      1

In [211]:
# Merge revenue and sales: revenue_and_sales
revenue_and_sales = pd.merge(revenue, sales, how='right', on=['city', 'state'])
revenue_and_sales

          city  branch_id state  revenue  units
0       Austin       10.0    TX    100.0      2
1       Denver       20.0    CO     83.0      4
2  Springfield       30.0    IL      4.0      1
3    Mendocino       47.0    CA    200.0      1
4  Springfield        NaN    MO      NaN      5

In [212]:
# Merge sales and managers: sales_and_managers
sales_and_managers = pd.merge(sales, managers, 
                              how='left', 
                              left_on=['city', 'state'], 
                              right_on=['branch', 'state'])
sales_and_managers

          city state  units       branch  branch_id   manager
0    Mendocino    CA      1    Mendocino       47.0     Brett
1       Denver    CO      4       Denver       20.0      Joel
2       Austin    TX      2       Austin       10.0  Charlers
3  Springfield    MO      5  Springfield       31.0     Sally
4  Springfield    IL      1          NaN        NaN       NaN

## Merging DataFrames with outer join

This exercise picks up where the previous one left off. The DataFrames `revenue`, `managers`, and `sales` are pre-loaded into your namespace (and, of course, pandas is imported as pd). Moreover, the merged DataFrames `revenue_and_sales` and `sales_and_managers` have been pre-computed exactly as you did in the previous exercise.

The merged DataFrames contain enough information to construct a DataFrame with 5 rows with all known information correctly aligned and each branch listed only once. You will try to merge the merged DataFrames on all matching keys (which computes an inner join by default). You can compare the result to an outer join and also to an outer join with restricted subset of columns as keys.

In [213]:
# Perform the first merge: merge_default
merge_default = pd.merge(sales_and_managers, revenue_and_sales)
merge_default

        city state  units     branch  branch_id   manager  revenue
0  Mendocino    CA      1  Mendocino       47.0     Brett    200.0
1     Denver    CO      4     Denver       20.0      Joel     83.0
2     Austin    TX      2     Austin       10.0  Charlers    100.0

In [214]:
# Perform the second merge: merge_outer
merge_outer = pd.merge(sales_and_managers, revenue_and_sales, how='outer')
merge_outer

          city state  units       branch  branch_id   manager  revenue
0    Mendocino    CA      1    Mendocino       47.0     Brett    200.0
1       Denver    CO      4       Denver       20.0      Joel     83.0
2       Austin    TX      2       Austin       10.0  Charlers    100.0
3  Springfield    MO      5  Springfield       31.0     Sally      NaN
4  Springfield    IL      1          NaN        NaN       NaN      NaN
5  Springfield    IL      1          NaN       30.0       NaN      4.0
6  Springfield    MO      5          NaN        NaN       NaN      NaN

In [215]:
# Perform the third merge: merge_outer_on
merge_outer_on = pd.merge(sales_and_managers, revenue_and_sales, on=['city', 'state'], how='outer')
merge_outer_on

,city,state,units_x,branch,branch_id_x,manager,branch_id_y,revenue,units_y
0,Mendocino,CA,1,Mendocino,47.0,Brett,47.0,200.0,1
1,Denver,CO,4,Denver,20.0,Joel,20.0,83.0,4
2,Austin,TX,2,Austin,10.0,Charlers,10.0,100.0,2
3,Springfield,MO,5,Springfield,31.0,Sally,NaN,NaN,5
4,Springfield,IL,1,NaN,NaN,NaN,30.0,4.0,1

Notice how the default merge drops the Springfield rows, while the default outer merge includes them twice.

<img src="images/pandas_merging_tools.png" alt="" style="width: 600px;"/>